---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleData.IsSymmetric
source: html/edd480ed-6368-da6c-2dec-2602ce106035.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.IsSymmetric Method

Check if this panel schedule is symmetric

## Syntax (C#)
```csharp
public bool IsSymmetric()
```

## Returns
True if this panel schedule is symmetric, false otherwise.